---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalCurveType.AllRigidLinks
enum: Autodesk.Revit.DB.Structure.AnalyticalCurveType
source: html/2c102724-4c8b-e648-31da-31fb383801fb.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalCurveType.AllRigidLinks

All Rigid Link curves.
 Rigid Link at end 0 (head) will be in the first entry.
 Rigid Link at end 1 (tail) will be in the last entry.